In [1]:
import pandas as pd
import numpy as np

## 과제 1: groupby

In [2]:
transactions = pd.read_csv('./data/retail/transactions.csv', parse_dates=['date'])
transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [3]:
(
    transactions
    .groupby('store_nbr')[['transactions']]
    .sum()
    .sort_values('transactions', ascending=False)
).iloc[:10]

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488

## 과제 2: groupby
Multiple Columns

In [4]:
transactions['month'] = transactions['date'].dt.month
transactions.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [5]:
(
    transactions
    .groupby(['store_nbr', 'month'])[['transactions']]
    .sum()
    .sort_values(['month', 'transactions'], ascending=[True, False])
)

                 transactions
store_nbr month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

## 과제 3: 데이터프레임 멀티인덱스

In [6]:
grouped = (
    transactions
    .groupby(['store_nbr', 'month'])
    .agg({'transactions': ['sum', 'mean']})
    .sort_values(['month', ('transactions', 'sum')], ascending=[True, False])
)
grouped.head()

                transactions
                         sum         mean
store_nbr month
44        1           628438  4246.202703
47        1           568824  3843.405405
45        1           538370  3637.635135
46        1           522763  3532.182432
3         1           463260  3151.428571

In [7]:
grouped.loc[[(3, 1)]]

                transactions
                         sum         mean
store_nbr month
3         1           463260  3151.428571

In [8]:
grouped.loc[:, [('transactions', 'mean')]]

                transactions
                        mean
store_nbr month
44        1      4246.202703
47        1      3843.405405
45        1      3637.635135
46        1      3532.182432
3         1      3151.428571
...                      ...
32        12      718.058333
21        12     1402.133333
42        12     1279.016667
29        12     1277.116667
22        12      844.166667

[641 rows x 1 columns]

In [9]:
(
    grouped
    .droplevel(0, axis=1)
    .reset_index()
)

     store_nbr  month     sum         mean
0           44      1  628438  4246.202703
1           47      1  568824  3843.405405
2           45      1  538370  3637.635135
3           46      1  522763  3532.182432
4            3      1  463260  3151.428571
..         ...    ...     ...          ...
636         32     12   86167   718.058333
637         21     12   84128  1402.133333
638         42     12   76741  1279.016667
639         29     12   76627  1277.116667
640         22     12   50650   844.166667

[641 rows x 4 columns]

## 과제 4: Agg 메서드

In [10]:
transactions = (
    transactions
    .assign(
        target_pct=transactions['transactions'] / 2500,
        met_target=(transactions['transactions'] / 2500) >= 1,
        bonus_payable=((transactions['transactions'] / 2500) >= 1) * 100,
        month=transactions.date.dt.month,
        day_of_week=transactions.date.dt.dayofweek
    )
)
transactions

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2
...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1
83484,2017-08-15,51,1573,8,0.6292,False,0,1
83485,2017-08-15,52,2255,8,0.9020,False,0,1
83486,2017-08-15,53,932,8,0.3728,False,0,1
83487,2017-08-15,54,802,8,0.3208,False,0,1

In [11]:
(
    transactions
    .groupby('store_nbr')
    .agg({
        'met_target': 'mean',
        'bonus_payable': 'sum'
    })
    .sort_values('bonus_payable', ascending=False)
)

           met_target  bonus_payable
store_nbr
47           0.999404         167600
44           0.998807         167500
45           0.997615         167300
3            0.998210         167300
46           0.989267         165900
8            0.888425         148900
48           0.690519         115800
49           0.637448         106900
50           0.453190          76000
11           0.296539          49700
34           0.217521          36500
24           0.175016          27600
9            0.100835          16900
38           0.041120           6900
52           0.322034           3800
51           0.021467           3600
6            0.018496           3100
2            0.017293           2900
25           0.016718           2700
20           0.022002           2000
4            0.007757           1300
31           0.007747           1300
7            0.007164           1200
1            0.006563           1100
5            0.006559           1100
37           0.005364            900
21           0.009358            700
39           0.003576            600
17           0.002389            400
53           0.002571            300
29           0.001144            100
14           0.000611            100
36           0.000645            100
18           0.000639            100
43           0.000598            100
42           0.000000              0
41           0.000000              0
40           0.000000              0
28           0.000000              0
35           0.000000              0
33           0.000000              0
32           0.000000              0
30           0.000000              0
27           0.000000              0
26           0.000000              0
23           0.000000              0
22           0.000000              0
19           0.000000              0
16           0.000000              0
15           0.000000              0
13           0.000000              0
12           0.000000              0
10           0.000000              0
54           0.000000              0

In [12]:
(
    transactions
    .groupby('day_of_week')
    .agg({
        'met_target': 'mean',
        'bonus_payable': 'sum'
    })
    .sort_values('bonus_payable', ascending=False)
)

             met_target  bonus_payable
day_of_week
5              0.222204         266400
6              0.204001         241700
4              0.179007         213000
0              0.160214         191600
2              0.160572         191000
1              0.146299         175500
3              0.142077         169100

## 과제 5: transform 메서드

In [13]:
transactions.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2

In [14]:
(
    transactions
    .query('store_nbr == 25')
    .groupby('day_of_week')
    .agg({'transactions': 'mean'})
)

             transactions
day_of_week
0              808.830435
1              740.245690
2              849.978261
3              800.818182
4             1102.817391
5             1376.090517
6              909.604348

In [15]:
(
    transactions
    .assign(
        avg_store_transactions=(
            transactions
            .groupby(['store_nbr', 'day_of_week'])['transactions']
            .transform('mean')
        ),
        difference=lambda x: x['transactions'] - x['avg_store_transactions']
    )
)

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week,avg_store_transactions,difference
0,2013-01-01,25,770,1,0.3080,False,0,1,740.245690,29.754310
1,2013-01-02,1,2111,1,0.8444,False,0,2,1870.782427,240.217573
2,2013-01-02,2,2358,1,0.9432,False,0,2,1952.652720,405.347280
3,2013-01-02,3,3487,1,1.3948,True,100,2,3142.682008,344.317992
4,2013-01-02,4,1922,1,0.7688,False,0,2,1499.569038,422.430962
...,...,...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1,2342.410788,461.589212
83484,2017-08-15,51,1573,8,0.6292,False,0,1,1548.448133,24.551867
83485,2017-08-15,52,2255,8,0.9020,False,0,1,1892.588235,362.411765
83486,2017-08-15,53,932,8,0.3728,False,0,1,877.214286,54.785714
83487,2017-08-15,54,802,8,0.3208,False,0,1,817.721992,-15.721992